# Модуль False Positive Filter

## Обзор
Модуль `fp_filter.py` реализует функциональность фильтрации ложных срабатываний при обнаружении уязвимостей. Использует методы машинного обучения для анализа и классификации результатов сканирования.

## Основные компоненты

### Класс FPFilter
Основной класс для фильтрации ложных срабатываний.

#### Методы:
- `__init__(self, model_path: str)`
  - Инициализация фильтра
  - Параметры:
    - `model_path`: Путь к обученной модели

- `filter(self, findings: List[Dict]) -> List[Dict]`
  - Фильтрация результатов сканирования
  - Параметры:
    - `findings`: Список найденных уязвимостей
  - Возвращает отфильтрованный список

- `train(self, training_data: List[Dict])`
  - Обучение модели на новых данных
  - Параметры:
    - `training_data`: Данные для обучения

- `evaluate(self, test_data: List[Dict]) -> Dict`
  - Оценка качества фильтрации
  - Параметры:
    - `test_data`: Данные для тестирования
  - Возвращает метрики качества

## Формат данных

### Входные данные
```python
{
    'type': str,          # Тип уязвимости
    'severity': str,      # Уровень серьезности
    'evidence': str,      # Доказательство
    'context': Dict,      # Контекст обнаружения
    'metadata': Dict      # Метаданные
}
```

### Результаты фильтрации
```python
{
    'finding': Dict,      # Исходная находка
    'is_fp': bool,        # Является ли ложным срабатыванием
    'confidence': float,  # Уверенность в классификации
    'reason': str         # Причина классификации
}
```

## Пример использования

```python
from ai.fp_filter import FPFilter

# Создание фильтра
filter = FPFilter(model_path='models/fp_filter.pkl')

# Фильтрация результатов
findings = [
    {
        'type': 'SQL Injection',
        'severity': 'high',
        'evidence': "' OR '1'='1",
        'context': {
            'url': 'https://example.com/login',
            'parameter': 'username'
        },
        'metadata': {
            'scanner': 'sql_scanner',
            'timestamp': '2023-01-01T12:00:00'
        }
    }
]

filtered_results = filter.filter(findings)

# Обработка результатов
for result in filtered_results:
    if not result['is_fp']:
        print(f"Найдена уязвимость: {result['finding']['type']}")
        print(f"Уверенность: {result['confidence']}")
    else:
        print(f"Ложное срабатывание: {result['reason']}")
```

## Особенности реализации

1. **Алгоритмы**
   - Классификация
   - Аномалии
   - Контекстный анализ
   - Эвристики

2. **Признаки**
   - Текстовые паттерны
   - Контекстные признаки
   - Метаданные
   - Исторические данные

3. **Метрики качества**
   - Precision
   - Recall
   - F1-score
   - ROC-AUC

## Рекомендации по использованию

1. Настройка модели:
   - Пороги классификации
   - Веса признаков
   - Правила фильтрации
   - Контекстные параметры

2. Обновление данных:
   - Новые паттерны
   - Обратная связь
   - Исторические данные
   - Контекстная информация

3. Мониторинг:
   - Качество фильтрации
   - Ложные отрицательные
   - Ложные положительные
   - Производительность

4. Интеграция:
   - С системами сканирования
   - С базами данных
   - С системами отчетности
   - С пайплайнами CI/CD 